SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_icache.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 ICACHE register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_ICACHE_H
#define EFR32SG28_ICACHE_H

#define ICACHE_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_ICACHE ICACHE
 * @{
 * @brief EFR32SG28 ICACHE Register Declaration.
 *****************************************************************************/

/** ICACHE Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP Version                                         */
  __IOM uint32_t             CTRL;                   /**< Control Register                                   */
  __IM  uint32_t             PCHITS;                 /**< Performance Counter Hits                           */
  __IM  uint32_t             PCMISSES;               /**< Performance Counter Misses                         */
  __IM  uint32_t             PCAHITS;                /**< Performance Counter Advanced Hits                  */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IOM uint32_t             LPMODE;                 /**< Low Power Mode                                     */
  __IOM uint32_t             IF;                     /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable                                   */
        uint32_t             RESERVED0[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP Version                                         */
  __IOM uint32_t             CTRL_SET;               /**< Control Register                                   */
  __IM  uint32_t             PCHITS_SET;             /**< Performance Counter Hits                           */
  __IM  uint32_t             PCMISSES_SET;           /**< Performance Counter Misses                         */
  __IM  uint32_t             PCAHITS_SET;            /**< Performance Counter Advanced Hits                  */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IOM uint32_t             LPMODE_SET;             /**< Low Power Mode                                     */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable                                   */
        uint32_t             RESERVED1[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP Version                                         */
  __IOM uint32_t             CTRL_CLR;               /**< Control Register                                   */
  __IM  uint32_t             PCHITS_CLR;             /**< Performance Counter Hits                           */
  __IM  uint32_t             PCMISSES_CLR;           /**< Performance Counter Misses                         */
  __IM  uint32_t             PCAHITS_CLR;            /**< Performance Counter Advanced Hits                  */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IOM uint32_t             LPMODE_CLR;             /**< Low Power Mode                                     */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable                                   */
        uint32_t             RESERVED2[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP Version                                         */
  __IOM uint32_t             CTRL_TGL;               /**< Control Register                                   */
  __IM  uint32_t             PCHITS_TGL;             /**< Performance Counter Hits                           */
  __IM  uint32_t             PCMISSES_TGL;           /**< Performance Counter Misses                         */
  __IM  uint32_t             PCAHITS_TGL;            /**< Performance Counter Advanced Hits                  */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IOM uint32_t             LPMODE_TGL;             /**< Low Power Mode                                     */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag                                     */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable                                   */
} ICACHE_TypeDef;
/** @} End of group EFR32SG28_ICACHE */

/**************************************************************************//**
 * @addtogroup EFR32SG28_ICACHE
 * @{
 * @defgroup EFR32SG28_ICACHE_BitFields ICACHE Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for ICACHE IPVERSION */
#define _ICACHE_IPVERSION_RESETVALUE            0x00000000UL                            /**< Default value for ICACHE_IPVERSION          */
#define _ICACHE_IPVERSION_MASK                  0xFFFFFFFFUL                            /**< Mask for ICACHE_IPVERSION                   */
#define _ICACHE_IPVERSION_IPVERSION_SHIFT       0                                       /**< Shift value for ICACHE_IPVERSION            */
#define _ICACHE_IPVERSION_IPVERSION_MASK        0xFFFFFFFFUL                            /**< Bit mask for ICACHE_IPVERSION               */
#define _ICACHE_IPVERSION_IPVERSION_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for ICACHE_IPVERSION           */
#define ICACHE_IPVERSION_IPVERSION_DEFAULT      (_ICACHE_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for ICACHE_IPVERSION   */

