SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_icache.h
/* Bit fields for ICACHE CTRL */
#define _ICACHE_CTRL_RESETVALUE                 0x00000000UL                            /**< Default value for ICACHE_CTRL               */
#define _ICACHE_CTRL_MASK                       0x00000007UL                            /**< Mask for ICACHE_CTRL                        */
#define ICACHE_CTRL_CACHEDIS                    (0x1UL << 0)                            /**< Cache Disable                               */
#define _ICACHE_CTRL_CACHEDIS_SHIFT             0                                       /**< Shift value for ICACHE_CACHEDIS             */
#define _ICACHE_CTRL_CACHEDIS_MASK              0x1UL                                   /**< Bit mask for ICACHE_CACHEDIS                */
#define _ICACHE_CTRL_CACHEDIS_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for ICACHE_CTRL                */
#define ICACHE_CTRL_CACHEDIS_DEFAULT            (_ICACHE_CTRL_CACHEDIS_DEFAULT << 0)    /**< Shifted mode DEFAULT for ICACHE_CTRL        */
#define ICACHE_CTRL_USEMPU                      (0x1UL << 1)                            /**< Use MPU                                     */
#define _ICACHE_CTRL_USEMPU_SHIFT               1                                       /**< Shift value for ICACHE_USEMPU               */
#define _ICACHE_CTRL_USEMPU_MASK                0x2UL                                   /**< Bit mask for ICACHE_USEMPU                  */
#define _ICACHE_CTRL_USEMPU_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for ICACHE_CTRL                */
#define ICACHE_CTRL_USEMPU_DEFAULT              (_ICACHE_CTRL_USEMPU_DEFAULT << 1)      /**< Shifted mode DEFAULT for ICACHE_CTRL        */
#define ICACHE_CTRL_AUTOFLUSHDIS                (0x1UL << 2)                            /**< Automatic Flushing Disable                  */
#define _ICACHE_CTRL_AUTOFLUSHDIS_SHIFT         2                                       /**< Shift value for ICACHE_AUTOFLUSHDIS         */
#define _ICACHE_CTRL_AUTOFLUSHDIS_MASK          0x4UL                                   /**< Bit mask for ICACHE_AUTOFLUSHDIS            */
#define _ICACHE_CTRL_AUTOFLUSHDIS_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for ICACHE_CTRL                */
#define ICACHE_CTRL_AUTOFLUSHDIS_DEFAULT        (_ICACHE_CTRL_AUTOFLUSHDIS_DEFAULT << 2) /**< Shifted mode DEFAULT for ICACHE_CTRL        */

/* Bit fields for ICACHE PCHITS */
#define _ICACHE_PCHITS_RESETVALUE               0x00000000UL                            /**< Default value for ICACHE_PCHITS             */
#define _ICACHE_PCHITS_MASK                     0xFFFFFFFFUL                            /**< Mask for ICACHE_PCHITS                      */
#define _ICACHE_PCHITS_PCHITS_SHIFT             0                                       /**< Shift value for ICACHE_PCHITS               */
#define _ICACHE_PCHITS_PCHITS_MASK              0xFFFFFFFFUL                            /**< Bit mask for ICACHE_PCHITS                  */
#define _ICACHE_PCHITS_PCHITS_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for ICACHE_PCHITS              */
#define ICACHE_PCHITS_PCHITS_DEFAULT            (_ICACHE_PCHITS_PCHITS_DEFAULT << 0)    /**< Shifted mode DEFAULT for ICACHE_PCHITS      */

/* Bit fields for ICACHE PCMISSES */
#define _ICACHE_PCMISSES_RESETVALUE             0x00000000UL                            /**< Default value for ICACHE_PCMISSES           */
#define _ICACHE_PCMISSES_MASK                   0xFFFFFFFFUL                            /**< Mask for ICACHE_PCMISSES                    */
#define _ICACHE_PCMISSES_PCMISSES_SHIFT         0                                       /**< Shift value for ICACHE_PCMISSES             */
#define _ICACHE_PCMISSES_PCMISSES_MASK          0xFFFFFFFFUL                            /**< Bit mask for ICACHE_PCMISSES                */
#define _ICACHE_PCMISSES_PCMISSES_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for ICACHE_PCMISSES            */
#define ICACHE_PCMISSES_PCMISSES_DEFAULT        (_ICACHE_PCMISSES_PCMISSES_DEFAULT << 0) /**< Shifted mode DEFAULT for ICACHE_PCMISSES    */

/* Bit fields for ICACHE PCAHITS */
#define _ICACHE_PCAHITS_RESETVALUE              0x00000000UL                            /**< Default value for ICACHE_PCAHITS            */
#define _ICACHE_PCAHITS_MASK                    0xFFFFFFFFUL                            /**< Mask for ICACHE_PCAHITS                     */
#define _ICACHE_PCAHITS_PCAHITS_SHIFT           0                                       /**< Shift value for ICACHE_PCAHITS              */
#define _ICACHE_PCAHITS_PCAHITS_MASK            0xFFFFFFFFUL                            /**< Bit mask for ICACHE_PCAHITS                 */
#define _ICACHE_PCAHITS_PCAHITS_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for ICACHE_PCAHITS             */
#define ICACHE_PCAHITS_PCAHITS_DEFAULT          (_ICACHE_PCAHITS_PCAHITS_DEFAULT << 0)  /**< Shifted mode DEFAULT for ICACHE_PCAHITS     */

/* Bit fields for ICACHE STATUS */
#define _ICACHE_STATUS_RESETVALUE               0x00000000UL                            /**< Default value for ICACHE_STATUS             */
#define _ICACHE_STATUS_MASK                     0x00000001UL                            /**< Mask for ICACHE_STATUS                      */
#define ICACHE_STATUS_PCRUNNING                 (0x1UL << 0)                            /**< PC Running                                  */
#define _ICACHE_STATUS_PCRUNNING_SHIFT          0                                       /**< Shift value for ICACHE_PCRUNNING            */
#define _ICACHE_STATUS_PCRUNNING_MASK           0x1UL                                   /**< Bit mask for ICACHE_PCRUNNING               */
#define _ICACHE_STATUS_PCRUNNING_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for ICACHE_STATUS              */
#define ICACHE_STATUS_PCRUNNING_DEFAULT         (_ICACHE_STATUS_PCRUNNING_DEFAULT << 0) /**< Shifted mode DEFAULT for ICACHE_STATUS      */

/* Bit fields for ICACHE CMD */
#define _ICACHE_CMD_RESETVALUE                  0x00000000UL                            /**< Default value for ICACHE_CMD                */
#define _ICACHE_CMD_MASK                        0x00000007UL                            /**< Mask for ICACHE_CMD                         */
#define ICACHE_CMD_FLUSH                        (0x1UL << 0)                            /**< Flush                                       */
#define _ICACHE_CMD_FLUSH_SHIFT                 0                                       /**< Shift value for ICACHE_FLUSH                */
#define _ICACHE_CMD_FLUSH_MASK                  0x1UL                                   /**< Bit mask for ICACHE_FLUSH                   */
#define _ICACHE_CMD_FLUSH_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ICACHE_CMD                 */
#define ICACHE_CMD_FLUSH_DEFAULT                (_ICACHE_CMD_FLUSH_DEFAULT << 0)        /**< Shifted mode DEFAULT for ICACHE_CMD         */
#define ICACHE_CMD_STARTPC                      (0x1UL << 1)                            /**< Start Performance Counters                  */
#define _ICACHE_CMD_STARTPC_SHIFT               1                                       /**< Shift value for ICACHE_STARTPC              */
#define _ICACHE_CMD_STARTPC_MASK                0x2UL                                   /**< Bit mask for ICACHE_STARTPC                 */
#define _ICACHE_CMD_STARTPC_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for ICACHE_CMD                 */
#define ICACHE_CMD_STARTPC_DEFAULT              (_ICACHE_CMD_STARTPC_DEFAULT << 1)      /**< Shifted mode DEFAULT for ICACHE_CMD         */
#define ICACHE_CMD_STOPPC                       (0x1UL << 2)                            /**< Stop Performance Counters                   */
#define _ICACHE_CMD_STOPPC_SHIFT                2                                       /**< Shift value for ICACHE_STOPPC               */
#define _ICACHE_CMD_STOPPC_MASK                 0x4UL                                   /**< Bit mask for ICACHE_STOPPC                  */
#define _ICACHE_CMD_STOPPC_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for ICACHE_CMD                 */
#define ICACHE_CMD_STOPPC_DEFAULT               (_ICACHE_CMD_STOPPC_DEFAULT << 2)       /**< Shifted mode DEFAULT for ICACHE_CMD         */

/* Bit fields for ICACHE LPMODE */
#define _ICACHE_LPMODE_RESETVALUE               0x00000023UL                            /**< Default value for ICACHE_LPMODE             */
#define _ICACHE_LPMODE_MASK                     0x000000F3UL                            /**< Mask for ICACHE_LPMODE                      */
#define _ICACHE_LPMODE_LPLEVEL_SHIFT            0                                       /**< Shift value for ICACHE_LPLEVEL              */
#define _ICACHE_LPMODE_LPLEVEL_MASK             0x3UL                                   /**< Bit mask for ICACHE_LPLEVEL                 */
#define _ICACHE_LPMODE_LPLEVEL_DEFAULT          0x00000003UL                            /**< Mode DEFAULT for ICACHE_LPMODE              */
#define _ICACHE_LPMODE_LPLEVEL_BASIC            0x00000000UL                            /**< Mode BASIC for ICACHE_LPMODE                */
#define _ICACHE_LPMODE_LPLEVEL_ADVANCED         0x00000001UL                            /**< Mode ADVANCED for ICACHE_LPMODE             */
#define _ICACHE_LPMODE_LPLEVEL_MINACTIVITY      0x00000003UL                            /**< Mode MINACTIVITY for ICACHE_LPMODE          */
#define ICACHE_LPMODE_LPLEVEL_DEFAULT           (_ICACHE_LPMODE_LPLEVEL_DEFAULT << 0)   /**< Shifted mode DEFAULT for ICACHE_LPMODE      */
#define ICACHE_LPMODE_LPLEVEL_BASIC             (_ICACHE_LPMODE_LPLEVEL_BASIC << 0)     /**< Shifted mode BASIC for ICACHE_LPMODE        */
#define ICACHE_LPMODE_LPLEVEL_ADVANCED          (_ICACHE_LPMODE_LPLEVEL_ADVANCED << 0)  /**< Shifted mode ADVANCED for ICACHE_LPMODE     */
#define ICACHE_LPMODE_LPLEVEL_MINACTIVITY       (_ICACHE_LPMODE_LPLEVEL_MINACTIVITY << 0) /**< Shifted mode MINACTIVITY for ICACHE_LPMODE  */
#define _ICACHE_LPMODE_NESTFACTOR_SHIFT         4                                       /**< Shift value for ICACHE_NESTFACTOR           */
#define _ICACHE_LPMODE_NESTFACTOR_MASK          0xF0UL                                  /**< Bit mask for ICACHE_NESTFACTOR              */
#define _ICACHE_LPMODE_NESTFACTOR_DEFAULT       0x00000002UL                            /**< Mode DEFAULT for ICACHE_LPMODE              */
#define ICACHE_LPMODE_NESTFACTOR_DEFAULT        (_ICACHE_LPMODE_NESTFACTOR_DEFAULT << 4) /**< Shifted mode DEFAULT for ICACHE_LPMODE      */

